{
  "roles": {
    "The Naysayer":{
      "optional": true,
      "rules":{
        "1":  "{3}, Pay 2 life: Reveal this Identity\n When this identity is revealed, counter a spell or ability. This ability can be countered as though it were a spell.\n{3}: Unreveal this Identity. You may play this ability only during your upkeep and only once per turn."
      }
    },
    "The Curious Cat":{
      "optional": true,
      "rules":{
        "1":  "{4}: Reveal this Identity\n During your draw step, you may draw up to two additional cards. If you do, pay 2 life or place one card from your hand to the bottom of your library."
      }
    },
    "The Grandfather Clock":{
      "optional": true,
      "rules":{
        "1":  "{3}: Reveal this Identity\n When this identity is revealed, place reset counters equal to the number of players. These counters cannot be proliferated.\n{3}, Remove a Reset Counter: Untap all permanents you control. Play this Ability once per turn."
      }
    },
    "The Opportunist":{
      "optional": true,
      "rules":{
        "1":  "{5}: Reveal this Identity\n For the rest of the game, whenever a spell or ability an opponent controls destroys a nontoken permanent you control, gain a treasure token.\nSacrifice 3 treasures: Target Player draws 1 card. Split Second."
      }
    },
    "The Impatient Child":{
      "optional": true,
      "rules":{
        "1":  "{0}: Reveal this Identity\n When this identity is revealed, draw three cards, create 3 treasure tokens and your maximum hand size is increased by 1 for as long as this identity is revealed."
      }
    },
    "The Metronome":{
      "optional": true,
      "rules":{
        "1":  "{4}: Reveal this Identity\n {2}: Copy target activated or triggered ability you control."
      }
    },
    "The Inquisitor":{
      "optional": true,
      "rules":{
        "1":  "{4}: Reveal this Identity\n When this identity is revealed, choose X permanents, where X is the number of opponents. Exile those permanents. (This ability does not target). Split Second."
      }
    }, 
    "The Magician":{
      "optional": true,
      "rules":{
        "8":  "{X}{2}: Reveal this Identity\n When this identity is revealed, scry X. Then, reveal the top two cards of your library. You may cast them immediately without playing their mana cost. Split Second."
      }
    },
    "The Guardian":{
      "optional": true,
      "rules":{
        "1":  "{2}: Reveal this Identity\n Until your next turn, prevent all damage that would be dealt to target player and each permanent they control. Split Second."
      }
    },
    "The Acrobat":{
      "optional": true,
      "rules":{
        "1": "{2}: Reveal this Identity\n When this identity is revealed, exile up to 5 target nonland permanents you don't control and any number of permanents you control. They enter the battlefield tapped under their owner's control at the end of the turn. Split Second."
      }
    },
    "The Priest and the Heretic":{
      "optional": true,
      "rules":{
        "1": "{4}: Reveal this Identity\n When this identity is revealed, target opponent loses 7 life and you gain 7 life. Choose a player. That player gains hexproof for 2 turns. Split Second."
      }
    },
    "The Martyr":{
      "optional": true,
      "rules":{
        "1": "{5}\n When this identity is revealed, until end of turn, all damage that would be dealt to target player and permanents they control is instead dealt to you. If your life would be reduced to below 1 this turn, it instead becomes your starting life total, untap all permanents you control, draw 7 cards, and you have no maximum hand size for the rest of the game."
      }
    },
    "The Politician":{
      "optional": true,
      "rules":{
        "1": "{4}: Reveal this Identity, only reveal during combat, during the declare blockers phase\n When this identity is revealed, untap all attacking creatures and remove them from combat. After this phase is another combat phase. Choose any number of creatures that had attacked this turn, those creatures must attack if able and you choose which player each creature attacks. Split Second."
      }
    },
    "The Troll":{
      "optional": true,
      "rules":{
        "1": "{4}: Reveal this Identity\n During your upkeep, if you do not control a creature named Mind Goblin, get a 1/3 Legendary Creature Token called Mind Goblin, and do the same for an enchantment called Deez Nuts. Mind Goblin has Indestructible and the ability \"Sacrifice Deez Nuts: Tap target creature. It does not untap during it's controller's next untap step.\""
      }
    },
    "The Puppeteer":{
      "optional": true,
      "rules":{
        "1": "{5}: Reveal this Identity\n Target player gains control of target spell. You may choose new targets for the spell. Split Second. {5}: Unreveal this identity."
      }
    },
    "The Beastmaster":{
      "optional": true,
      "rules":{
        "1": "{2}: Reveal this Identity\n Up to two target players create two 4/4 green beast creature tokens. Split Second."
      }
    },
    "The Thief":{
      "optional": true,
      "rules":{
        "18": "{5}, Pay 2 life: Reveal this Identity\n Any number of target players mill 5 cards. For each player that milled a creature this way, you may place up to one of their milled creatures onto the battlefield. Split Second."
      }
    },
    "The Demon":{
      "optional": true,
      "rules":{
        "1": "{4}, Pay 4 life: Reveal this Identity\n When you reveal this identity, you may search through your library for three cards and place them into your hand. Split Second."
      }
    },
    "The Cunning":{
      "optional": true,
      "rules":{
        "1": "{2}{Y}: Y is the number of players. Reveal this Identity\n Choose any number of opponents: They reveal their hand. You may exile up to one nonland card from their hand. For the rest of the game you may play those cards and spend mana on them as though it was mana of any color Split Second."
      }
    },
    "The Teeth":{
      "optional": true,
      "rules":{
        "1": "{3}: Reveal this Identity\n When this identity is revealed, create a 6/6 Green Dinosaur Creature named Colossal Dreadmaw with Casting Cost {4}{G}{G}. Split Second. At the beginning of your upkeep, you create another copy."
      }
    },
    "The Cheater":{
      "optional": true,
      "rules":{
        "1": "{3}: Reveal this Identity\n For the rest of the game, you may sneak permanents from your hand without paying their mana cost. However, if a player catches you during that same turn, the card is instead exiled."
      }
    },
    "The Discordant":{
      "optional": true,
      "rules":{
        "1": "{5}: Reveal this Identity\n When you reveal this identity, choose \"Sonic the Motherfucking Hedgehog\", \"Ublock Origin\", \"Dwayne 'The Rock' Johnson\", or \"Scott\". If you choose Sonic the Motherfucking Hedgehog, you may ignore all instances of split second for the rest of the game. If you choose Ublock Origin, you may block creatures as though they were blockable and did not have trample or flying (even if effects would state otherwise) for the rest of the game. If you choose Dwayne 'The Rock' Johnson, effects you control can target and destroy permanents you do not own as though they did not have hexproof, shroud, or indestructible for the rest of the game. If you select Scott, your opponents may mock you for choosing the objectively worst option (in priority order), and then you may unreveal this identity."
      }
    },
    "The World Eater":{
      "optional": true,
      "rules":{
        "1": "{0}: Reveal this Identity\n Destroy all nonland permanents. They cannot be regenerated."
      }
    },
    "The Jester":{
      "optional": true,
      "rules":{
        "1": "{3}: Choose two target Commanders in any zone. Those two decks swap commanders with that deck and the cards swap to their respective zones. While this identity is revealed all commanders can be cast using mana of any color. Split Second."
      }
    },
    "The Reincarnated":{
      "optional": true,
      "rules":{
        "1": "{0}: Reveal your Identity as someone Loses the Game\n Set your life total to your starting life total. Shuffle your hand and graveyard into your deck and draw 7 cards. Gain the losing player's identity card and unreveal it."
      }
    },
    "":{
      "optional": true,
      "rules":{
        "1": "{4}: Reveal this Identity\n As this identity is revealed, place X parasite counters on your Identity, where X is the number of players.\nAll players play with their hands revealed while it has at least one parasite counter.\nRemove a Parasite Counter. Choose a card in the hand of another player. If able, they immediately cast that spell. You control them to tap their mana and activate abilities to cast it. You control the player to select targets and modes on the card. Timing rules still apply. Split Second."
      }
    },
    "The Stoic":{
      "optional": true,
      "rules":{
        "1": "{7} Reveal this Identity\n Whenever you cast a spell, you may pay 2 life as you do so. If you do, your spell gains hexproof while it is on the stack."
      }
    },
    "The Leader": {
      "optional": true,
      "rules": {
        "1": "{0}: Reveal this Identity\n The leader gains priority before each player's untap step and may cast their first card each turn as though it had flash."
      }
    }
  }
}
